ben/blog/2010-11-16-command-line-scripts-with-sinatra.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Command Line Scripts With Sinatra</title>
<meta name="author" content="Ben" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Command Line Scripts With Sinatra</h1>
<p><strong>Tags:</strong> <span class="tags"><a href="tags/technology.html">technology</a></span></p>

<p>
There are times when I want to do batch processing or perform other command line activities that don't fit well into the web-framework. The trouble is, my db connection info is based on what "environement" I'm working in. I could re-create the hooks to set that environment, but I'd rather leverage the existing capabilities in Sinatra to do so. That way if they change how it works in the future, I don't have to work through all that again.
</p>

<p>
In Sinatra, there's a Delegator module that handles passing requests for methods like 'production?' or 'set' off to the App. With that in mind, I can easily just include the Delegator and let it handle everything from there.
</p>

<p>
Here a sample of my code:
</p>

<div class="org-src-container">
<pre class="src src-ruby">require 'rubygems'
require 'optparse'
require 'sinatra/base'

include Sinatra::Delegator
options = {}
OptionParser.new do |op|
  op.on('-e env') { |val| set :environment, val.to_sym }
end.parse!
</pre>
</div>

<p>
You can see this on my github page as well: <a href="https://github.com/benprew/mtg/blob/master/bin/match_xtns.rb">match_xtns.rb</a>
</p>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2010-11-16</p>
<p class="author">Author: Ben</p>
</div>
</body>
</html>
